/*
** ============================================================================
**
** Project: 
**     Bomber
**
** File:
**     ska_wav.h
**
** Description:
**     @DesciptionAboutThisFileHere
**
** Copyright (c) 2000 SK Teletech, Co. All Rights Reserved.
**
** History:
**
** When       who        what, where, why
** ---------- --------   ------------------------------------------------------
** 2001-01-17   khekim     Created.
**
** ============================================================================
*/

#ifndef _SKA_WAV_H_
#define _SKA_WAV_H_

#ifdef __cplusplus
extern "C" {
#endif
	
/* 
**----------------------------------------------------------------------------
**  Includes
**----------------------------------------------------------------------------
*/

/*
**----------------------------------------------------------------------------
**  Definitions
**----------------------------------------------------------------------------
*/
//Wap에서 컨텐츠를 선택한 경우 어떤 종류의 컨텐츠인지에 대한 것
enum {
	NEW_CONTENTS = 0x01, // 새로 다운 로드 받을 새 컨텐츠
	OLD_CONTENTS = 0x02, // 이미 보관함에 저장되어 있어서 새로받기 여부를 물어야 하는 컨텐츠
	CONNECT_CONTENTS = 0x03 // 다운로드 받다 중지되어 이어받기 여부를 물어야 하는 컨텐츠
};

/*
**----------------------------------------------------------------------------
**  Type Definitions
**----------------------------------------------------------------------------
*/

/*
**----------------------------------------------------------------------------
**  General Declarations
**----------------------------------------------------------------------------
*/

/*
**---------------------------------------------------------------------------
**  Variable Declarations
**---------------------------------------------------------------------------
*/

/*
**---------------------------------------------------------------------------
**  Function(external use only) Declarations
**---------------------------------------------------------------------------
*/
extern	void SKY_API SKA_MainWavelet(SKY_EVENT_T *pEvent);
extern  void SKY_API SKA_IdleWavelet(SKY_EVENT_T *pEvent);
extern  void SKY_API SKA_WaveletStreaming(SKY_EVENT_T *pEvent);
extern  void SKY_API sSKA_MainOnWavelet(SKY_EVENT_T *pEvent);
extern  BYTE MM_ReadContentInfo(int cpid, int ctsid, char *cntName);

#ifdef __cplusplus
}  /* extern "C" */
#endif

#endif  /* _SKA_WAV_H_ */
